# --- Homebrew Taps ---
tap "homebrew/bundle"
tap "nicholascross/promptly"
tap "sst/tap"

# --- Homebrew Formulae ---
brew "age" # Simple, modern, secure file encryption
brew "bash-language-server" # Language Server for Bash
brew "bash" # Bourne-Again SHell, a UNIX command interpreter
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "bc" # Arbitrary precision numeric processing language
brew "btop" # Resource monitor. C++ version and continuation of bashtop and bpytop
brew "caddy" # Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "chafa" # Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "cheat" # Create and view interactive cheat sheets for *nix commands
brew "codex" # OpenAI's coding agent that runs in your terminal
brew "coreutils" # GNU File, Shell, and Text utilities
brew "dockerfile-language-server" # Language server for Dockerfiles powered by Node, TypeScript, and VSCode
brew "dosbox-x" # DOSBox with accurate emulation and wide testing
brew "exiftool" # Perl lib for reading and writing EXIF metadata
brew "eza" # Modern, maintained replacement for ls
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder written in Go
brew "gawk" # GNU awk utility
brew "gh" # GitHub command-line tool
brew "ghostscript" # Interpreter for PostScript and PDF
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "github-mcp-server" # GitHub Model Context Protocol server for AI tools
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "gollama" # Go manage your Ollama models
brew "hadolint" # Smarter Dockerfile linter to validate best practices
brew "imagemagick" # Tools and libraries to manipulate images in many formats
brew "jq" # Lightweight and flexible command-line JSON processor
brew "jsonlint" # JSON parser and validator with a CLI
brew "lazygit" # Simple terminal UI for git commands
brew "llama.cpp" # LLM inference in C/C++
brew "lua-language-server" # Language Server for the Lua language
brew "luacheck" # Tool for linting and static analysis of Lua code
brew "markdownlint-cli" # CLI for Node.js style checker and lint tool for Markdown files
brew "mpv" # Media player based on MPlayer and mplayer2
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "nmap" # Port scanning utility for large networks
brew "node" # Platform built on V8 to build network applications
brew "openjdk" # Development kit for the Java programming language
brew "pngpaste" # Paste PNG into files
brew "pnpm" # Fast, disk space efficient package manager
brew "prettier" # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettierd" # Prettier daemon
brew "rclone" # Rsync for cloud storage
brew "redis" # Persistent key-value database, with built-in net interface
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "rom-tools" # Tools for Multiple Arcade Machine Emulator
brew "ruby" # Powerful, clean, object-oriented scripting language
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt" # Autoformat shell script source code
brew "sops" # Editor of encrypted files
brew "sst/tap/opencode" # The AI coding agent built for the terminal.
brew "stow" # Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stylua" # Opinionated Lua code formatter
brew "swiftformat" # Formatting tool for reformatting Swift code
brew "swiftlint" # Tool to enforce Swift style and conventions
brew "telnet" # User interface to the TELNET protocol
brew "tlrc" # Official tldr client written in Rust
brew "tmux" # Terminal multiplexer
brew "uv" # Extremely fast Python package installer and resolver, written in Rust
brew "vale" # Syntax-aware linter for prose
brew "vapor" # Command-line tool for Vapor (Server-side Swift web framework)
brew "wget" # Internet file retriever
brew "wireshark" # Network analyzer and capture tool - without graphical user interface
brew "yaml-language-server" # Language Server for Yaml Files
brew "yamllint" # Linter for YAML files
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yt-dlp" # Feature-rich command-line audio/video downloader
brew "yydecode" # Decode yEnc archives
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh

# --- Homebrew Casks ---
cask "affinity-designer" # Professional graphic design software
cask "affinity-photo" # Professional image editing software
cask "affinity-publisher" # Professional desktop publishing software
cask "android-platform-tools" # Android SDK component
cask "balenaetcher" # Tool to flash OS images to SD cards & USB drives
cask "calibre" # E-books management software
cask "chatgpt" # OpenAI's official ChatGPT desktop app
cask "cursor" # Write, edit, and chat about your code with AI
cask "cyberduck" # Server and cloud storage browser
cask "daisydisk" # Disk space visualiser
cask "db-browser-for-sqlite" # Browser for SQLite databases
cask "discord" # Voice and text chat software
cask "docker-desktop" # App to build and share containerised applications and microservices
cask "drivethrurpg" # Sync DriveThruRPG libraries to compatible devices
cask "firefox" # Web browser
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "fork" # GIT client
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
cask "gog-galaxy" # Game client
cask "google-chrome" # Web browser
cask "google-drive" # Client for the Google Drive storage service
cask "hammerspoon" # Desktop automation application
cask "imageoptim" # Tool to optimise images to a smaller size
cask "istat-menus" # System monitoring app
cask "kicad" # Electronics design automation suite
cask "lm-studio" # Discover, download, and run local LLMs
cask "lycheeslicer" # Slicer for Resin 3D printers
cask "maccy" # Clipboard manager
cask "macpilot" # Graphical user interface for the command terminal
cask "marked-app" # Previewer for Markdown, MultiMarkdown and other text markup languages
cask "mgba-app" # Game Boy Advance emulator
cask "microsoft-auto-update" # Provides updates to various Microsoft products
cask "microsoft-excel" # Spreadsheet software
cask "microsoft-powerpoint" # Presentation software
cask "microsoft-word" # Word processor
cask "mini-vmac" # Allows modern computers to run software made for early Apple computers
cask "musicbrainz-picard" # Music tagger
cask "name-mangler" # Multi-file renaming tool
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
cask "ollama-app" # Get up and running with large language models locally
cask "openscad@snapshot" # Programmable solid 3D CAD modeller
cask "orcaslicer" # G-code generator for 3D printers
cask "orion" # WebKit based web browser
cask "proxyman" # HTTP debugging proxy
cask "rapidapi" # HTTP client that helps testing and describing APIs
cask "replacicon" # App icon replacement utility
cask "retroarch-metal" # Frontend for emulators, game engines and media players (Metal graphics API)
cask "reveal" # Powerful runtime view debugging for iOS developers
cask "sf-symbols" # Tool that provides consistent, highly configurable symbols for apps
cask "shottr" # Screenshot measurement and annotation tool
cask "steam" # Video game digital distribution service
cask "syncthing-app" # Real time file synchronisation software
cask "telegram" # Messaging app with a focus on speed and security
cask "the-unarchiver" # Unpacks archive files
cask "transnomino" # Batch rename utility
cask "utm" # Virtual machines UI using QEMU
cask "visual-studio-code" # Open-source code editor
cask "vlc" # Multimedia player

# --- Mac App Store (mas) ---

# --- VSCode Extensions ---
vscode "continue.continue"
vscode "docker.docker"
vscode "enkia.tokyo-night"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "sst-dev.opencode"
